{
  "profileName": {
    "nicknameFirst": "Sergio",
    "nicknameSecond": "Brü"
  },
  "position": "Software Developer",
  "headline": {
    "localized": {
      "de_DE": "Java-Entwickler | PL/SQL-Entwickler | Angular Web |Spezialisierung auf Hochlastsysteme & Finanzlösungen (PL/SQL, Analyse)",
      "en_US": "Java Developer | PL/SQL Developer | Angular Web | Specializing in High-Load Systems & Financial Solutions (PL/SQL, Analysis)",
      "ru_RU": "Java разработчик | PL SQL разработчик (pl+ опыт) | Angular Web | Специализация на высоконагруженных системах и финансовых решениях"
    },
    "preferredLocale": null
  },
  "localizedHeadline": null,
  "firstName": {
    "localized": {
      "de_DE": "Sergey",
      "en_US": "Sergei",
      "ru_RU": "Сергей"
    },
    "preferredLocale": null
  },
  "localizedFirstName": null,
  "lastName": {
    "localized": {
      "de_DE": "Brusentsov",
      "en_US": "Brusentsov",
      "ru_RU": "Брусенцов"
    },
    "preferredLocale": null
  },
  "localizedLastName": null,
  "about": {
    "localized": {
      "de_DE": "Hallo! Ich begann meine Karriere als operativer Banker und entwickelte mich beruflich zur Position des „Leiters der Betriebsabteilung“. Danach wechselte ich radikal die Berufslaufbahn und wurde PL/SQL-Entwickler. Nach der erfolgreichen Umsetzung zahlreicher Projekte habe ich Oracle PL/SQL, Java und moderne Frameworks wie Angular, Spring und Hibernate gemeistert und kann eine wichtige Rolle in der Softwareentwicklung bei modernen Technologie- und Finanzunternehmen übernehmen. Wenn ich nicht gerade im Code vertieft bin, finden Sie mich beim Wandern, Snowboarden oder beim Genießen guter elektronischer Musik. Und natürlich bedeutet mir meine Familie alles.",
      "en_US": "Hi there! I started my career as an operational banker and advanced professionally to the position of “Head of Operations Department.” I then made a significant career shift to become a PL/SQL Developer. Having completed numerous successful projects, I have mastered Oracle PL/SQL, Java, and modern frameworks such as Angular, Spring, and Hibernate, positioning myself as a valuable asset for software development in tech and financial companies. When I’m not immersed in coding, you’ll find me hiking, snowboarding, or enjoying some great electronic music. And of course, my family means the world to me.",
      "ru_RU": "Привет! Я начал свою карьеру как операционный работник банка и профессионально вырос до позиции “Руководитель операционного департамента”. Затем я кардинально сменил сферу деятельности и стал разработчиком PL/SQL. Реализовав множество успешных проектов, я освоил Oracle PL/SQL, Java и современные фреймворки такие как Angular, Spring и Hibernate, что позволяет мне выполнять важную роль разработчика программных решений в современных технологических и финансовых компаниях. Когда я не погружен в код, вы найдете меня за походом, катанием на сноуборде или наслаждением хорошей электронной музыкой. И, конечно, моя семья для меня означает весь мир."
    },
    "preferredLocale": null
  },
  "localizedAbout": null,
  "experience": [
    {
      "job_item": {
        "dates": "12.2022 - present days",
        "company": {
          "localized": {
            "de_DE": "Informtech GmBH",
            "en_US": "Informtech,  Ltd",
            "ru_RU": "Информтех ООО, "
          },
          "preferredLocale": null
        },
        "localizedCompany": "Informtech,  Ltd",
        "title": {
          "localized": {
            "de_DE": "Software Entwickler",
            "en_US": "Software developer",
            "ru_RU": "Разработчик "
          },
          "preferredLocale": null
        },
        "title_desc": {
          "localized": {
            "de_DE": "Entwicklung neuer Lösungen und Wartung widerstandsfähiger Backend-Systeme mit Java und PL/SQL.",
            "en_US": "Developing new solutions and maintaining resilient  backend systems using Java and PL/SQL",
            "ru_RU": "Разработка новых решений и поддержка устойчивых backend-систем с использованием Java и PL/SQL"
          },
          "preferredLocale": null
        },
        "responsibilities": {
          "localized": {
            "de_DE": "Bei Informtech LLC arbeitete ich als PL/SQL-Entwickler und Java-Anwendungsentwickler mit Schwerpunkt auf der Middleware-Schicht. Zu meinen Aufgaben gehörten die Optimierung von SQL-Abfragen und die Entwicklung von Datenmigrationswerkzeugen zur Übertragung von Daten von Oracle DB nach PostgreSQL. Ich arbeitete mit cross-funktionalen Teams zusammen, um neue Funktionen zu entwerfen und umzusetzen.",
            "en_US": "At Informtech LLC, I served as a PL/SQL Developer and Java Application Developer focusing on the middleware layer. My responsibilities included optimizing SQL queries and developing data migration tools to transfer data from Oracle DB to PostgreSQL. Collaborated with cross-functional teams to design and implement new features.",
            "ru_RU": "работая в ООО Информтех я выполняю роль разработчика pl/sql кода, java приложений в middle-ware layer, оптимизирую SQL запросы, разрабатываю средства миграции данных из Oracle DB в PostrgeSQL. Работаю в кросс-функциональных командах для создания и реализации новых возможностей в бизнес-приложениях."
          },
          "preferredLocale": null
        },
        "achievements": {
          "localized": {
            "de_DE": "Eine meiner bemerkenswerten Leistungen war die Erstellung einer benutzerdefinierten Bibliothek auf Basis der Reflection API. Diese Bibliothek ermöglichte die Generierung von einsatzbereitem Code, der an die neue Infrastruktur des Kunden angepasst wurde.",
            "en_US": "One of my notable achievements was creating a custom library based on the Reflection API. This library facilitated the generation of ready-to-use code adapted to the client’s new infrastructure.",
            "ru_RU": "Мое достижение в этой компании - написание кастомной библиотеки на базе Reflection API которая позволила генерировать готовый код, адаптированный под новую инфраструктуру заказчика."
          },
          "preferredLocale": null
        }
      }
    },
    {
      "job_item": {
        "dates": "04.2022 - 09.2022 (6 months)",
        "company": {
          "localized": {
            "de_DE": "Yandex Fintech GmBH",
            "en_US": "Yandex Fintech, Ltd",
            "ru_RU": "яндекс технологии, OOO"
          },
          "preferredLocale": null
        },
        "localizedCompany": "Yandex Fintech, Ltd",
        "title": {
          "localized": {
            "de_DE": "Software Entwickler",
            "en_US": "System analyst",
            "ru_RU": "Разработчик"
          },
          "preferredLocale": null
        },
        "title_desc": {
          "localized": {
            "de_DE": "Systemanalytiker und Architekt für Softwarelösungen, Java Software Entwickler",
            "en_US": "System Analyst and Software Solutions Architect, Java Software Developer",
            "ru_RU": "Системный аналитик и архитектор программных решений, Java разработчик"
          },
          "preferredLocale": null
        },
        "responsibilities": {
          "localized": {
            "de_DE": "Bei Yandex Technologies übernahm ich mehrere Rollen, darunter Systemanalytiker und Architekt für Softwarelösungen, Technischer Redakteur, Produktverantwortlicher, Code-Reviewer. Ich war verantwortlich für die Schätzung der Aufgabenaufwände und die Bearbeitung von Anfragen aus dem Kunden-Backlog.",
            "en_US": "At Yandex Technologies, I undertook multiple roles, including System Analyst and Software Solutions Architect, Technical Writer, Product Owner, Code Reviewer, I was estimating tasks costs and customers backlog requests.",
            "ru_RU": "В Yandex Technologies я выполнял несколько ролей, включая роль системного аналитика и архитектора программных решений, технического писателя, владельца продукта, ревьюера кода и наконец Java разработчика. Я занимался оценкой затрат на задачи и запросов из бэклога клиентов."
          },
          "preferredLocale": null
        },
        "achievements": {
          "localized": {
            "de_DE": "Mit Technologien wie Java Spring Boot, Swagger, PL/SQL und PL/+ war ich Teil von cross-funktionalen Teams, die erfolgreich ein Zahlungsgateway mit dem Nationalen Zahlungskarten-System (NPSK) in der Pilotphase implementierten und starteten. Zudem war ich an der Markteinführung des Produkts „Yandex Split“ beteiligt, einem Buy-Now-Pay-Later-Service.",
            "en_US": "Using technologies such as Java Spring Boot, Swagger, PL/SQL, and PL/+, I was part of cross-functional teams that successfully implemented and launched a payment gateway with the National Payment Card System (NPSK) in pilot operation. Additionally, I contributed to the market launch of the “Yandex Split” product, a buy-now, pay-later service.",
            "ru_RU": "Используя технологии Java Spring Boot, Swagger, PL SQL, PL + я в составе кросс-функциональных команд реализовал и запустил в пилотную эксплуатацию платежный шлюз с НПСК, принял участие в выводе на рынок продукта \"Яндекс Сплит\" (buy-now, pay-later service)."
          },
          "preferredLocale": null
        }
      }
    },
    {
      "job_item": {
        "dates": "06.2020 - 03.2022 (1 yr 6 mos)",
        "company": {
          "localized": {
            "de_DE": "Innotech (T1 company)",
            "en_US": "Innotech (T1 company)",
            "ru_RU": "Innotech (T1)"
          },
          "preferredLocale": null
        },
        "localizedCompany": "Innotech (T1 company)",
        "title": {
          "localized": {
            "de_DE": "PL/SQL Software Entwickler",
            "en_US": "PL/SQL Developer",
            "ru_RU": "PL/SQL разработчик"
          },
          "preferredLocale": null
        },
        "title_desc": {
          "localized": {
            "de_DE": "Oracle PL/SQL-Entwicklung. Entwurf neuer Lösungen und Systemkomponenten.",
            "en_US": "Oracle PL/SQL development. Designing new solutions and systems components.",
            "ru_RU": "Разработка Oracle PL/SQL, создание новых приложений и системных компонентов."
          },
          "preferredLocale": null
        },
        "responsibilities": {
          "localized": {
            "de_DE": "Entwicklung und Optimierung von PL/SQL-Prozeduren und -Paketen.\r\nBeteiligung an Datenmigrationsprojekten und Systemintegrationen.\r\nBereitstellung neuer Lösungen und Patches für bestehende Systeme.",
            "en_US": "Developing and optimizing PL/SQL procedures and packages.\r\nParticipating in data migration projects and system integrations.\r\nDeploying new solutions and patches for existing systems.\r\n",
            "ru_RU": "Разработка и оптимизация PL/SQL процедур и пакетов.\r\nУчастие в проектах миграции данных и интеграции систем.\r\nРазвертывание новых решений и патчей для существующих систем."
          },
          "preferredLocale": null
        },
        "achievements": {
          "localized": {
            "de_DE": "Ich habe eine leistungsstarke Bibliothek entwickelt, die Finanztransaktionslogs schnell und präzise analysieren kann und so eine effiziente Datenmigration ermöglicht.",
            "en_US": "I've created a high-performance library that can rapidly and precisely parse financial transaction logs, facilitating efficient data migration.",
            "ru_RU": "Я создал высокопроизводительную библиотеку, которая могла быстро и точно анализировать журналы финансовых транзакций, что способствовало эффективной миграции данных."
          },
          "preferredLocale": null
        }
      }
    },
    {
      "job_item": {
        "dates": "07.2013 - 06.2020 (6 yr 11 mos)",
        "company": {
          "localized": {
            "de_DE": "Informtech Ltd.",
            "en_US": "Informtech Ltd.",
            "ru_RU": "Информтехб ООО"
          },
          "preferredLocale": null
        },
        "localizedCompany": "Informtech Ltd.",
        "title": {
          "localized": {
            "de_DE": "PL/SQL Software Entwickler",
            "en_US": "Application developer | PL SQL | Oracle DB",
            "ru_RU": "PL/SQL разработчик"
          },
          "preferredLocale": "en_US"
        },
        "title_desc": {
          "localized": {
            "de_DE": "Oracle PL/SQL-Entwicklung. Entwurf neuer Lösungen und Systemkomponenten.",
            "en_US": "Oracle PL/SQL development. Designing new solutions and systems components.",
            "ru_RU": "Разработка Oracle PL/SQL, создание новых приложений и системных компонентов."
          },
          "preferredLocale": null
        },
        "responsibilities": {
          "localized": {
            "de_DE": "Entwicklung und Optimierung von PL/SQL-Prozeduren und -Paketen.\r\nBeteiligung an Datenmigrationsprojekten und Systemintegrationen.\r\nBereitstellung neuer Lösungen und Patches für bestehende Systeme.",
            "en_US": "Developed and optimized complex PL/SQL scripts to support data integration, migration, and reporting in a large-scale project focused on mergers and acquisitions involving 3 banks of TOP-30 (Russia).\r\nDesigned database solutions to manage data consistency and security across multiple banking systems, ensuring seamless integration of critical financial data during mergers.\r\nCollaborated with cross-functional teams to create custom database procedures, triggers, and functions to support evolving business and compliance requirements.",
            "ru_RU": "Разработка и оптимизация PL/SQL процедур и пакетов.\r\nУчастие в проектах миграции данных и интеграции систем.\r\nРазвертывание новых решений и патчей для существующих систем."
          },
          "preferredLocale": null
        },
        "achievements": {
          "localized": {
            "de_DE": "Spielte eine vichtige Rolle bei der reibungslosen Überführung und Konsolidierung von Daten in 30 fusionierten Banken und trug dazu bei, die Ausfallzeiten bei der Datenmigration durch optimierte PL/SQL-Skripte um 40 % zu reduzieren.\r\nUnterstützte Schulungssitzungen für Bankpersonal zu neuer Software und regulatorischen Regelwerken, unterstützte die Einarbeitung von über 200 Mitarbeitern und verbesserte die Einhaltung aktualisierter Finanzrichtlinien.",
            "en_US": "Played an essential role in the smooth transition and consolidation of data across 30 merged banks, helping to reduce data migration downtime by 40% through optimized PL/SQL scripts.\r\nContributed to training sessions for banking personnel on new software and regulatory rule sets, assisting in onboarding over 200 staff members and enhancing compliance with updated financial policies.",
            "ru_RU": "Сыграл важную роль в плавном переходе и консолидации данных в 30 объединенных банках, помогая сократить время простоя при миграции данных на 40% за счет оптимизированных скриптов PL/SQL.\r\nУчаствовал в учебных сессиях для банковского персонала по новому программному обеспечению и нормативным правилам, помогая в адаптации более 200 сотрудников и повышая соблюдение обновленных финансовых политик."
          },
          "preferredLocale": null
        }
      }
    }
  ],
  "profilePicture": {
    "displayImage": "urn:li:digitalmediaAsset:C4D00AAAAbBCDEFGhiJ"
  },
  "vanityName": "s.brusentsov",
  "id": "secretcode"
}